/**************************************************************************************************

 @File   : [ MeshFilterDX.cpp ] 
 @Auther : Unisawa

**************************************************************************************************/



//***********************************************************************************************//
//                                                                                               //
//  @Include File                                                                                //
//                                                                                               //
//***********************************************************************************************//

//-----MainSetting-----//
#include "000_Main/Main.h"
#include "001_Manager/Manager.h"

//-----Object-----//
#include "004_Component/0040_RenderDX/00420_Mesh/MeshDX.h"
#include "004_Component/0040_RenderDX/00420_Mesh/MeshRenderDX.h"
#include "004_Component/0040_RenderDX/00420_Mesh/MeshFilterDX.h"
#include "004_Component/0040_RenderDX/00403_Texture/TextureDXManager.h"

//***********************************************************************************************//
//                                                                                               //
//  @Macro Definition                                                                            //
//                                                                                               //
//***********************************************************************************************//
#ifdef USE_DIRECTX

//***********************************************************************************************//
//                                                                                               //
//  @Static Variable                                                                             //
//                                                                                               //
//***********************************************************************************************//

/*=================================================================================================
  @Summary: コンストラクタ
  @Details: None
=================================================================================================*/
MeshFilterDX::MeshFilterDX(GameObject* pObject, std::string ComponentName) : Component(pObject, RENDERER, ComponentName)
{
    pMesh       = new MeshDX();
    pMeshRender = RequireComponent<MeshRenderDX>();
}

/*===============================================================================================* 
  @Summary: デストラクタ
  @Details: None
 *===============================================================================================*/
MeshFilterDX::~MeshFilterDX()
{
    SafeDeleteUninit(pMeshRender);
    delete pMesh;
}

/*===============================================================================================* 
  @Summary: 指定したテクスチャクラスを直接設定する
  @Details: None
 *===============================================================================================*/
void MeshFilterDX::SetTexture(std::string value)
{
    pMeshRender->material.mainTexture = TextureDXManager::Load(value);

    if (pMeshRender->material.mainTexture != NULL)
    {
        pMeshRender->material.mainTextureID = pMeshRender->material.mainTexture->textureID;
    }
}

/*===============================================================================================* 
  @Summary: 指定したテクスチャID(Hash値)を直接設定する
  @Details: None
 *===============================================================================================*/
void MeshFilterDX::SetTexture(Texture* value)
{
    pMeshRender->material.mainTexture = value;
    pMeshRender->material.mainTextureID = value->textureID;

    value->repeatedNum++;    // このテクスチャを使用している数が増えたため増加させる
}

/*===============================================================================================* 
  @Summary: テクスチャ情報を取得する
  @Details: None
 *===============================================================================================*/
Texture* MeshFilterDX::GetTexture()
{
    return pMeshRender->material.mainTexture;
}

/*===============================================================================================* 
  @Summary: 
  @Details: 
 *===============================================================================================*/

#endif
//===============================================================================================//
//                                                                                               //
//                                          @End of File                                         //
//                                                                                               //
//===============================================================================================//