/**************************************************************************************************

 @File   : [ GameObject.cpp ] 全ての実体のベースクラス
 @Auther : Unisawa

**************************************************************************************************/



//***********************************************************************************************//
//                                                                                               //
//  @Include File                                                                                //
//                                                                                               //
//***********************************************************************************************//

//-----MainSetting-----//
#include "002_Manager/Manager.h"

//-----Object-----//
#include "004_Component/Component.h"
#include "004_Component/0042_GameObject/Transform.h"
#include "004_Component/0042_GameObject/GameObject.h"
#include "004_Component/0042_GameObject/GameObjectManager.h"

//***********************************************************************************************//
//                                                                                               //
//  @Macro Definition                                                                            //
//                                                                                               //
//***********************************************************************************************//

//***********************************************************************************************//
//                                                                                               //
//  @Static Variable                                                                             //
//                                                                                               //
//***********************************************************************************************//

/*=================================================================================================
  @Summary: コンストラクタ
  @Details: None
=================================================================================================*/
GameObject::GameObject(LAYER Layer)
{
    activeSelf = true;
    transform  = new Transform(this);

    SetLayer(Layer);
    SetName("GameObject");

    GameObjectManager::LinkList(this, Layer);
}

/*===============================================================================================* 
  @Summary: デストラクタ
  @Details: None
 *===============================================================================================*/
GameObject::~GameObject()
{
    Component* pComponent;

    for (auto Iterator = componentList.begin(); Iterator != componentList.end();)
    {
        pComponent = (*Iterator);

        // コンポーネントの削除
        SafeDeleteUninit(pComponent);

        Iterator++;
    }

    componentList.clear();

    SafeDelete(transform);
}

/*===============================================================================================* 
  @Summary: 初期化処理
  @Details: None
 *===============================================================================================*/
void GameObject::Init()
{

}

/*===============================================================================================* 
  @Summary: 終了処理
  @Details: None
 *===============================================================================================*/
void GameObject::Uninit()
{

}

/*===============================================================================================* 
  @Summary: 更新処理
  @Details: None
 *===============================================================================================*/
void GameObject::Update()
{

}

/*===============================================================================================* 
  @Summary: GameObject にアタッチされているコンポーネントを取得する
  @Details: None
 *===============================================================================================*/
Component* GameObject::GetComponent(std::string name)
{
    for (auto Iterator = componentList.begin(); Iterator != componentList.end(); ++Iterator)
    {
        if (name == (*Iterator)->GetComponentName())
        {
            return (*Iterator);
        }
    }

    return NULL;
}

/*===============================================================================================* 
  @Summary: GameObject にアタッチされているコンポーネントを取得する
  @Details: None
 *===============================================================================================*/
template <typename T> T* GameObject::GetComponent()
{
    for (auto Iterator = componentList.begin(); Iterator != componentList.end(); ++Iterator)
    {
        //if (T::className == (*Iterator)->GetComponentName())
        {
            return (T*)(*Iterator);
        }
    }

    return NULL;
}

//===============================================================================================//
//                                                                                               //
//                                          @End of File                                         //
//                                                                                               //
//===============================================================================================//